ysuolmai/mimiclaw/sdkconfig.defaults.esp32c3
# MimiClaw - ESP32-C3 Super Mini Lite Target Configuration
CONFIG_IDF_TARGET="esp32c3"

# ESP32-C3 Super Mini: usually 4 MB flash, no PSRAM.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# CPU 160MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# Size/memory oriented build.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

# WiFi/RAM trimming for no-PSRAM C3.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=2
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_RX_BA_WIN=2
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_LWIP_MAX_SOCKETS=6
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=2048
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=8

# TLS: keep buffers modest; the LLM path is still the largest runtime user.
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048

# Keep compile-time WebSocket support because ws_server.c is part of the shared source set.
# The C3-lite runtime profile does not start the WebSocket gateway.
CONFIG_HTTPD_WS_SUPPORT=y

# Custom 4MB C3 partition table.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-c3.csv"

# C3 USB Serial/JTAG console.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
